Repository: AlixBarreaux/godot-translation-playground
Catalog: locale/*/messages.po
Languages: ar_ae, es, fr, he, ja, pl, ru, th, zh

# Menu actions
source: Close
es: Cerrar
fr: Fermer

# Distance
source: Close
es: Cerca de
fr: Proche

source: Use English
ar_ae: استخدم اللغة الإنجليزية
es: Utilizar el inglés
fr: Utiliser l'anglais
he: השתמש באנגלית
ja: 英語を使う
pl: Użyj języka angielskiego
ru: Используйте английский язык
th: ใช้ภาษาอังกฤษ
zh: 使用英语

source: Use Arabic
ar_ae: استخدم اللغة العربية
es: Usar árabe
fr: Utiliser l'arabe
he: שימוש בערבית
ja: アラビア語を使う
pl: Używaj języka arabskiego
ru: Используйте арабский язык
th: ใช้ภาษาอาหรับ
zh: 使用阿拉伯语

source: Use Chinese
ar_ae: استخدم الصينية
es: Usar chino
fr: Utiliser le chinois
he: השתמש בסינית
ja: 中国語を使う
ru: Используйте китайский язык
th: ใช้ภาษาจีน
zh: 使用中文

source: Use French
ar_ae: استخدم الفرنسية
es: Utilizar el francés
fr: Utiliser le français
he: השתמש בצרפתית
ja: フランス語を使う
pl: Użyj języka francuskiego
ru: Используйте французский язык
th: ใช้ภาษาฝรั่งเศส
zh: 使用法语

source: Use Hebrew
ar_ae: استخدم العبرية
es: Usar el hebreo
fr: Utiliser l'hébreu
he: שימוש בעברית
ru: Используйте иврит
th: ใช้ภาษาฮิบรู

source: Use Japanese
ar_ae: استخدم اليابانية
es: Utilizar el japonés
fr: Utiliser le japonais
he: שימוש ביפנית
ja: 日本語を使う
pl: Użyj japońskiego
ru: Используйте японский язык
th: ใช้ภาษาญี่ปุ่น
zh: 使用日语

source: Use Polish
ar_ae: استخدام البولندية
es: Utilizar polaco
fr: Utiliser le polonais
he: שימוש בפולנית
ja: ポリッシュを使う
pl: Użyj języka polskiego
ru: Используйте польский полировку
th: ใช้ภาษาโปแลนด์
zh: 使用抛光剂

source: Use Russian
ar_ae: استخدام الروسية
es: Usar ruso
fr: Utiliser le russe
he: השתמש ברוסית
ja: ロシア語を使用
ru: Используйте русский язык
th: ใช้ภาษารัสเซีย
zh: 使用俄语

source: Use Spanish
ar_ae: استخدم الأسبانية
es: Utilizar el español
fr: Utiliser l'espagnol
he: שימוש בספרדית
ja: スペイン語を使う
pl: Używanie języka hiszpańskiego
ru: Используйте испанский язык
th: ใช้ภาษาสเปน
zh: 使用西班牙语

source: Use Thai
ar_ae: استخدام التايلاندية
es: Usar tailandés
fr: Utiliser le thaï
he: השתמש בתאילנדית
ru: Используйте тайский язык
th: ใช้ภาษาไทย

source: This is a demo of how a game can be internationalized. Translations are created in a CSV file and then imported into Godot. Using a TTF/OTF font with CJK is required for this demo to run. One is provided in the font/ folder that you can use for your games. Godot allows internationalized text to change automatically when the locale is modified. Resources can also be set internationalized alternatives and replaced automatically on locale change.
ar_ae: هذا عرض توضيحي لكيفية تدويل اللعبة. يتم إنشاء الترجمات في ملف CSV ثم يتم استيرادها إلى Godot. يلزم استخدام خط TTF / OTF مع CJK لتشغيل هذا العرض التوضيحي. يتم توفير واحد في مجلد الخط / الذي يمكنك استخدامه لألعابك. يسمح Godot للنص الدولي بالتغيير تلقائيا عندما تكون الإعدادات المحلية تعديل. يمكن أيضا وضع بدائل دولية للموارد واستبدالها تلقائيا على تغيير الإعدادات المحلية.
es: Esta es una demostración de cómo se puede internacionalizar un juego. Las traducciones se crean en un archivo CSV y luego se importan a Godot. Es necesario utilizar una fuente TTF/OTF con CJK para que esta demo funcione. Se proporciona una en la carpeta font/ que puede utilizar para sus juegos.
fr: Ceci est une démo concernant comment un jeu peut être internationalisé. Les traductions sont crées dans un fichier CSV et sont ensuite importées dans Godot. Utiliser une police TTF/OTF avec CJK est requis afin que la démo puisse fonctionner. Une police est fournie. dans le dossier font/ que vous pouvez utiliser pour vos jeux. Godot autorise le text internationalisé à changer automatiquement quand la localisation est modifiée. Des alternatives peuvent aussi être appliquées aux ressources qui elles-même peuvent être remplacées.
he: זוהי הדגמה של איך משחק יכול להיות בינלאומי. תרגומים נוצרים בקובץ CSV ולאחר מכן מיובאים אל Godot. שימוש בגופן TTF/OTF עם CJK נדרש כדי שהדגמה זו תופעל. אחד מהם מסופק בגופן/ תיקיה שבהם תוכל להשתמש עבור המשחקים שלך. Godot מאפשר לטקסט בינלאומי להשתנות באופן אוטומטי כאשר האזור הוא שונה. ניתן גם להגדיר משאבים חלופיים בינלאומיים ולהחליף אותם באופן אוטומטי בעת שינוי אזור.
ja: これは、ゲームがどのように国際化されるかのデモです。 翻訳はCSVファイルで作成され、Godotにインポートされます。 このデモを実行するには、日中韓のTTF/OTFフォントが必要です。フォントは が用意されています。 Godotでは、ロケールが変更されると国際化されたテキストが自動的に変更されます。 変更されます。リソースも国際化された選択肢を設定し、ロケールが変更されたときに自動的に置き換えることができます。 を自動的に置き換えることもできます。
pl: Jest to demonstracja tego, jak można umiędzynarodowić grę. Tłumaczenia są tworzone w pliku CSV, a następnie importowane do Godota. Do uruchomienia tego demo wymagane jest użycie czcionki TTF/OTF z CJK. Jedna z nich jest dostępna w folderze font/, który można wykorzystać w swoich grach.
ru: Это демонстрация того, как можно интернационализировать игру. Переводы создаются в CSV-файле и затем импортируются в Godot. Для работы демонстрации необходимо использовать шрифт TTF/OTF с кодировкой CJK. Один из них предоставляется в папке font/, которую вы можете использовать для своих игр. Godot позволяет интернационализированному тексту автоматически изменяться при изменении локали изменении локали. Ресурсам также можно задавать интернационализированные альтернативы и заменять их автоматически при смене локали.
th: นี่เป็นการสาธิตว่าเกมสามารถทําให้เป็นสากลได้อย่างไร. การแปลจะถูกสร้างขึ้นในไฟล์ CSV แล้วนําเข้าสู่ Godot. จําเป็นต้องใช้แบบอักษร TTF/OTF กับ CJK เพื่อให้การสาธิตนี้ทํางาน. มีหนึ่งให้ ในแบบอักษร/โฟลเดอร์ที่คุณสามารถใช้สําหรับเกมของคุณ. Godot อนุญาตให้ข้อความที่เป็นสากลเปลี่ยนแปลงโดยอัตโนมัติเมื่อสถานที่นั้นอยู่ แก้ไข. ทรัพยากรยังสามารถตั้งค่าทางเลือกที่เป็นสากลและเปลี่ยนใหม่ได้ โดยอัตโนมัติในการเปลี่ยนสถานที่.
zh: 这是一个游戏国际化的演示。 翻译以 CSV 文件创建，然后导入 Godot。 要运行此演示，需要使用中日韩 TTF/OTF 字体。在 文件夹中提供了一种字体，您可以将其用于您的游戏。 当本地设置被修改时，Godot 允许自动更改国际化文本。 修改。资源也可以设置为国际化的替代方案，并在区域变更时自动替换。 自动替换。

source: Hello!
ar_ae: مرحبا!
es: ¡Hola!
fr: Bonjour!
he: שלום!
ja: こんにちは！
pl: Cześć!
ru: Здравствуйте!
th: สวัสดี!
zh: 你好！

source: Click me
ar_ae: انقر فوق لي
es: Hazme clic
fr: Cliquez sur moi
he: לחץ עלי
ja: クリック
pl: Kliknij mnie
ru: Нажмите мне
th: คลิกฉัน
zh: 点击我

source: You currently have no fruits!
ar_ae: ليس لديك حاليا فاكهة!
es: ¡Actualmente no tienes fruta!
fr: Vous n'avez actuellement pas de fruit!
he: כרגע אין לך פירות!
ja: あなたは現在、果実を持っていない！
ru: В настоящее время у вас нет фруктов!
th: ขณะนี้คุณไม่มีผลไม้!
zh: 您目前没有水果！

source: You currently have %d apple!
es: ¡Actualmente tiene %d manzana!
pl: Obecnie posiadasz %d jabłko!

source: You currently have %d broccoli!
es: ¡Actualmente tiene %d brócoli!

source: You currently have %d apples!
ar_ae: لديك حاليا %d تفاحة!
fr: Vous avez actuellement %d pomme!
he: כרגע יש לך תפוח אחד!
ja: 現在、あなたは%d個のリンゴをお持ちです！
ru: В настоящее время у вас есть %d яблоко!
th: ขณะนี้คุณมีแอปเปิ้ล %d ลูก!
zh: 您目前有 %d 个苹果！

source: You currently have %d broccolis!
ar_ae: لديك حاليا %d بروكوليس!
fr: Vous avez actuellement %d brocoli!
ru: В настоящее время у вас есть %d броколист!
th: ขณะนี้คุณมีบรอกโคลิส %d ตัว!

source: You currently have %d brocolis!
he: כרגע יש לך ברוקולי אחד!
ja: 現在、ブロッコリーが%d個あります！
zh: 您目前有 %d 个西兰花！

source: You currently have no fruit!
pl: Obecnie nie masz żadnych owoców!

source: You currently have %d brocoli!
pl: Obecnie posiadasz %d brokuł!
